; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	spectrograph4 - mode
	thermograph3 - mode
	image0 - mode
	thermograph6 - mode
	infrared1 - mode
	infrared7 - mode
	image2 - mode
	infrared5 - mode
	GroundStation1 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Planet5 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 infrared5)
	(supports instrument0 thermograph6)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 infrared5)
	(supports instrument1 thermograph6)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument2 infrared1)
	(supports instrument2 infrared7)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
	(supports instrument3 thermograph6)
	(supports instrument3 spectrograph4)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 infrared1)
	(supports instrument4 thermograph3)
	(supports instrument4 image0)
	(calibration_target instrument4 Star3)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
	(supports instrument5 thermograph6)
	(supports instrument5 image2)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 thermograph6)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 image2)
	(calibration_target instrument7 GroundStation2)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet5)
)
(:goal (and
	(pointing satellite0 Planet8)
	(pointing satellite2 Planet8)
	(have_image Planet5 thermograph6)
	(have_image Planet6 image0)
	(have_image Planet6 spectrograph4)
	(have_image Planet7 thermograph6)
	(have_image Planet7 image0)
	(have_image Planet8 image0)
	(have_image Planet8 infrared5)
	(have_image Phenomenon9 thermograph6)
))

)

; plan
1. (turn_to satellite2 groundstation1 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 groundstation1)
   goals met: 0 of 10
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 10
3. (calibrate satellite2 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 0 of 10
4. (turn_to satellite2 planet6 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 planet6)
   goals met: 0 of 10
5. (take_image satellite2 planet6 instrument3 spectrograph4)
   added: (have_image planet6 spectrograph4)
   goals met: 1 of 10
6. (turn_to satellite2 planet5 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet5)
   goals met: 1 of 10
7. (take_image satellite2 planet5 instrument3 thermograph6)
   added: (have_image planet5 thermograph6)
   goals met: 2 of 10
8. (turn_to satellite2 phenomenon9 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 phenomenon9)
   goals met: 2 of 10
9. (turn_to satellite0 groundstation1 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation1)
   goals met: 2 of 10
10. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 10
11. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 2 of 10
12. (take_image satellite2 phenomenon9 instrument3 thermograph6)
   added: (have_image phenomenon9 thermograph6)
   goals met: 3 of 10
13. (turn_to satellite0 planet6 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet6)
   goals met: 3 of 10
14. (take_image satellite0 planet6 instrument1 image0)
   added: (have_image planet6 image0)
   goals met: 4 of 10
15. (turn_to satellite0 planet7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet7)
   goals met: 4 of 10
16. (take_image satellite0 planet7 instrument1 image0)
   added: (have_image planet7 image0)
   goals met: 5 of 10
17. (take_image satellite0 planet7 instrument1 thermograph6)
   added: (have_image planet7 thermograph6)
   goals met: 6 of 10
18. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 7 of 10
19. (take_image satellite0 planet8 instrument1 image0)
   added: (have_image planet8 image0)
   goals met: 8 of 10
20. (take_image satellite0 planet8 instrument1 infrared5)
   added: (have_image planet8 infrared5)
   goals met: 9 of 10
21. (turn_to satellite2 planet8 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 planet8)
   goals met: 10 of 10
